EmptyButter/PCB-Drone/SEGGER NRF51/nRF/Device/SDK_Driver/nrf_esbBACK.c
    for (int i = 0; i < NRF_ESB_RX_FIFO_SIZE; i++)
    {
        m_rx_fifo.p_payload[i] = &m_rx_fifo_payload[i];
    }
}

static void tx_fifo_remove_last()
{
    if (m_tx_fifo.count > 0)
    {
        DISABLE_RF_IRQ();

        m_tx_fifo.count--;
        if (++m_tx_fifo.exit_point >= NRF_ESB_TX_FIFO_SIZE)
        {
            m_tx_fifo.exit_point = 0;
        }

        ENABLE_RF_IRQ();
    }
}

/** @brief  Function to push the content of the rx_buffer to the RX FIFO.
 *
 *  The module will point the register NRF_RADIO->PACKETPTR to a buffer for receiving packets.
 *  After receiving a packet the module will call this function to copy the received data to
 *  the RX FIFO.
 *
 *  @param  pipe Pipe number to set for the packet.
 *  @param  pid  Packet ID.
 *
 *  @retval true   Operation successful.
 *  @retval false  Operation failed.
 */
static bool rx_fifo_push_rfbuf(uint8_t pipe, uint8_t pid)
{
    if (m_rx_fifo.count < NRF_ESB_RX_FIFO_SIZE)
    {
        if (m_config_local.protocol == NRF_ESB_PROTOCOL_ESB_DPL)
        {
            if (m_rx_payload_buffer[0] > NRF_ESB_MAX_PAYLOAD_LENGTH)
            {
                return false;
            }

            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length = m_rx_payload_buffer[0];
        }
        else if (m_config_local.mode == NRF_ESB_MODE_PTX)
        {
            // Received packet is an acknowledgment
            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length = 0;
        }
        else
        {
            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length = m_config_local.payload_length;
        }

        //modified by David
                memcpy(m_rx_fifo.p_payload[m_rx_fifo.entry_point]->data, &m_rx_payload_buffer[2],
                       m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length);
        //process packet bit shift error before push to fifo//TODO:invest what causes payload data shift left by 1 bit
        /* start modify */
//        for (int i = 1; i < m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length; i++)
//        {
//            m_rx_payload_buffer[i] = m_rx_payload_buffer[i] >> 1;
//        }
//        m_rx_payload_buffer[1] = m_rx_payload_buffer[1] | ((m_rx_payload_buffer[0] & 0x01) << 7);
//        memcpy(m_rx_fifo.p_payload[m_rx_fifo.entry_point]->data, &m_rx_payload_buffer[1],
//            m_rx_fifo.p_payload[m_rx_fifo.entry_point]->length);
        /* end modify */
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->pipe = pipe;  
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->rssi = NRF_RADIO->RSSISAMPLE;
        m_rx_fifo.p_payload[m_rx_fifo.entry_point]->pid = pid;
        if (++m_rx_fifo.entry_point >= NRF_ESB_RX_FIFO_SIZE)
        {
            m_rx_fifo.entry_point = 0;
        }
        m_rx_fifo.count++;

        return true;
    }

    return false;
}

static void sys_timer_init()
{
    // Configure the system timer with a 1 MHz base frequency
    NRF_ESB_SYS_TIMER->PRESCALER = 4;
    NRF_ESB_SYS_TIMER->BITMODE = TIMER_BITMODE_BITMODE_16Bit;
    NRF_ESB_SYS_TIMER->SHORTS = TIMER_SHORTS_COMPARE1_CLEAR_Msk | TIMER_SHORTS_COMPARE1_STOP_Msk;
}

static void ppi_init()
{
    NRF_PPI->CH[NRF_ESB_PPI_TIMER_START].EEP = (uint32_t)&NRF_RADIO->EVENTS_READY;
    NRF_PPI->CH[NRF_ESB_PPI_TIMER_START].TEP = (uint32_t)&NRF_ESB_SYS_TIMER->TASKS_START;

    NRF_PPI->CH[NRF_ESB_PPI_TIMER_STOP].EEP = (uint32_t)&NRF_RADIO->EVENTS_ADDRESS;
    NRF_PPI->CH[NRF_ESB_PPI_TIMER_STOP].TEP = (uint32_t)&NRF_ESB_SYS_TIMER->TASKS_STOP;

    NRF_PPI->CH[NRF_ESB_PPI_RX_TIMEOUT].EEP = (uint32_t)&NRF_ESB_SYS_TIMER->EVENTS_COMPARE[0];
    NRF_PPI->CH[NRF_ESB_PPI_RX_TIMEOUT].TEP = (uint32_t)&NRF_RADIO->TASKS_DISABLE;

    NRF_PPI->CH[NRF_ESB_PPI_TX_START].EEP = (uint32_t)&NRF_ESB_SYS_TIMER->EVENTS_COMPARE[1];
    NRF_PPI->CH[NRF_ESB_PPI_TX_START].TEP = (uint32_t)&NRF_RADIO->TASKS_TXEN;
}

static void start_tx_transaction()
{
    bool ack;

    m_last_tx_attempts = 1;
    // Prepare the payload
    mp_current_payload = m_tx_fifo.p_payload[m_tx_fifo.exit_point];

    switch (m_config_local.protocol)
    {
    case NRF_ESB_PROTOCOL_ESB:
        update_rf_payload_format(mp_current_payload->length);
        m_tx_payload_buffer[0] = mp_current_payload->pid;
        m_tx_payload_buffer[1] = 0;
        memcpy(&m_tx_payload_buffer[2], mp_current_payload->data, mp_current_payload->length);

        NRF_RADIO->SHORTS = RADIO_SHORTS_COMMON | RADIO_SHORTS_DISABLED_RXEN_Msk;
        NRF_RADIO->INTENSET = RADIO_INTENSET_DISABLED_Msk | RADIO_INTENSET_READY_Msk;

        // Configure the retransmit counter
        m_retransmits_remaining = m_config_local.retransmit_count;
        on_radio_disabled = on_radio_disabled_tx;
        m_nrf_esb_mainstate = NRF_ESB_STATE_PTX_TX_ACK;
        break;

    case NRF_ESB_PROTOCOL_ESB_DPL:
        ack = !mp_current_payload->noack || !m_config_local.selective_auto_ack;
        m_tx_payload_buffer[0] = mp_current_payload->length;
        m_tx_payload_buffer[1] = mp_current_payload->pid << 1;
        m_tx_payload_buffer[1] |= ack ? 0x00 : 0x01;
        memcpy(&m_tx_payload_buffer[2], mp_current_payload->data, mp_current_payload->length);

        // Handling ack if noack is set to false or if selective auto ack is turned off
        if (ack)
        {
            NRF_RADIO->SHORTS = RADIO_SHORTS_COMMON | RADIO_SHORTS_DISABLED_RXEN_Msk;
            NRF_RADIO->INTENSET = RADIO_INTENSET_DISABLED_Msk | RADIO_INTENSET_READY_Msk;

            // Configure the retransmit counter
            m_retransmits_remaining = m_config_local.retransmit_count;
            on_radio_disabled = on_radio_disabled_tx;
            m_nrf_esb_mainstate = NRF_ESB_STATE_PTX_TX_ACK;
        }
        else
        {
            NRF_RADIO->SHORTS = RADIO_SHORTS_COMMON;
            NRF_RADIO->INTENSET = RADIO_INTENSET_DISABLED_Msk;
            on_radio_disabled = on_radio_disabled_tx_noack;
            m_nrf_esb_mainstate = NRF_ESB_STATE_PTX_TX;
        }
        break;

    default:
        // Should not be reached
        break;
    }

